//백줄 이하, 여러 도형 동물 그리기
//창의성, 미적 요소, 수업내용 활용 정도
function setup()
{
  createCanvas(600,400);
}
function draw()
{
  background("#B5F89C");
  noStroke();
  fill("#349933");
  ellipse(285,340,400,80)

  
  fill("#863B3B");
  arc(160,185,50,50,0,PI);
  arc(370,90,30,30,radians(240),radians(440));
  arc(355,70,30,30,radians(20),radians(180));
  arc(335,60,30,30,radians(240),radians(430));
  arc(320,40,30,30,radians(20),radians(230));
  arc(420,90,30,30,radians(100),radians(300));
  arc(437,70,30,30,radians(2),radians(160));
  arc(457,59,30,30,radians(110),radians(300));
  arc(475,45,30,30,radians(-50),radians(180));
  rect(390,275,25,90)
  triangle(350,130,320,90,365,100)
  triangle(350,130,320,90,365,100)
  triangle(440,130,470,90,425,100)
  rect(220,275,25,90);
  fill("#C05936");
  rect(350,100,90,75);
  rect(160,275,25,90);
  rect(330,275,25,90);
  triangle(440,120,455,96,425,103)
  triangle(350,120,335,96,365,103)
  square(350,175,65);
  quad(415,185,415,280, 160,280,160,185)
  fill(255,255,255);
  circle(375,130,30);
  fill(0,0,0);
  circle(375,130,15);
  rect(330,345,25,20);
  rect(160,345,25,20);
  rect(390,345,25,20);
  rect(220,345,25,20);
  fill("#F8E9CA")
  quad(440,150,440,175,400,175,400,150);
  triangle(180,200,220,210,200,240)
  circle(255,235,40)
  quad(370,220,340,270,300,270,310,210)
  fill("#000000");
  quad(443,150,443,175,435,175,435,150);
  fill("#863B3B");
  quad(415,175,415,250,350,180,350,175)
  
}